---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsSwitchboardSchedule
source: html/30f565e3-fb0a-9738-ce07-cf07d679b032.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsSwitchboardSchedule Property

Checks to see if this object is switchboard schedule template element.

## Syntax (C#)
```csharp
public bool IsSwitchboardSchedule { get; }
```